In [55]:
dataPath="C:/Users/David/Desktop/DevOps2019/2023/python/titanic/data"

genderPath=dataPath+"\\gender_submission.csv"
trainPath=dataPath+"\\train.csv"
testPath=dataPath+"\\test.csv"

In [56]:
import pandas as pd
import numpy as np

genderData=pd.read_csv(genderPath)
genderData

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [57]:
trainData=pd.read_csv(trainPath)
trainData

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [58]:
testData=pd.read_csv(testPath)
testData

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [59]:
#combine the data  
data = pd.concat([trainData, testData], sort=False)

In [60]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,NaN,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,NaN,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,NaN,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,NaN,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,NaN,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

# Missing Values Check

In [61]:
data.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
dtype: int64

## Fill in for Missing Values - Age, Cabin, and Embarked
For age, we'll take the median age and randomly fill it + or - the standard deviation.
We'll replace the Cabin and Embarked NaN values with dummy data. In this case, we'll just substitute NaN for "U" or "Unknown"

In [69]:
print(data["Age"].std())
print(data["Age"].median())

14.39077160868867
28.364645403132315

In [62]:
#filling for 
median_age = data['Age'].median()
std_dev = data['Age'].std()

for i in data[data['Age'].isnull()].index:
    data.at[i,'Age'] = median_age + np.random.normal(0,std_dev)

#Fare
median_fare = data['Fare'].median()
std_devf = data['Fare'].std()

for i in data[data['Fare'].isnull()].index:
    data.at[i,'Fare'] = median_fare + np.random.normal(0,std_devf)

In [63]:
data["Cabin"].fillna("Unknown", inplace=True)
data["Embarked"].fillna("Unknown", inplace=True)

# Encoding Categorical Data

In [87]:
data["Sex"].unique()

array(['male', 'female'], dtype=object)

In [ ]:
data["Embarked"].unique()

array(['S', 'C', 'Q', 'Unknown'], dtype=object)

In [ ]:
data["Cabin"].unique()

array(['Unknown', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148', 'B45', 'B36', 'A21', 'D34', 'A9', 'C31', 'B61', 'C53',
       'D43', 'C130', 'C132', 'C55 C57', 'C116', 'F', 'A29', 'C6', 'C28',
       'C51', 'C97', 'D22', 'B10', 'E45', 'E52', 'A11', 'B11', 'C80',
       'C89', 'F E46', 'B26', 'F E57', 'A18', 'E60', 'E39 E41',
       'B52 B54 B56', 'C39', 'B24', 'D40', 'D38', 'C105'], dtype=object)

In [82]:
#map the Sex data to numeric
sex_map = {'male':0, 'female':1}
data['Sex_encoded'] = data['Sex'].map(sex_map)

In [81]:
#map the categorical data to numeric
embarked_map = {"S": 1, "C": 2, "Q": 3, "Unknown": 4}
data['Embarked_encoded'] = data['Embarked'].map(embarked_map)

In [93]:
#map the cabin data to numeric using one hot encoding
#map the cabin data to numeric
from sklearn.preprocessing import OneHotEncoder 
ordinal_encoder = OneHotEncoder()
data['cabin_onehot'] = ordinal_encoder.fit_transform(data[["Cabin"]])

In [90]:
data['Sex_encoded'].unique()

array([0, 1], dtype=int64)

In [94]:
data['cabin_onehot'].unique()

TypeError: unhashable type: 'csr_matrix'

In [92]:
data['Embarked_encoded'].unique()

array([1, 2, 3, 4], dtype=int64)

In [98]:
data.isnull().sum()

PassengerId           0
Survived            418
Pclass                0
Name                  0
Sex                   0
Age                   0
SibSp                 0
Parch                 0
Ticket                0
Fare                  0
Cabin                 0
Embarked              0
Embarked_encoded      0
cabin_onehot          0
Sex_encoded           0
dtype: int64

In [99]:
#reseperate the train and test data, now that everything is cleaned.
trainData=data[0:891]
testData=data[891:]

In [100]:
from sklearn.model_selection import train_test_split

In [101]:
#split the data into train and test
X_train, X_test, y_train, y_test = train_test_split(trainData.drop(['Survived'], axis=1), trainData['Survived'], test_size=0.2, random_state=42)

In [102]:
X_train

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Embarked_encoded,cabin_onehot,Sex_encoded
331,332,1,"Partner, Mr. Austen",male,45.500000,0,0,113043,28.5000,C124,S,1,"(0, 186)\t1.0\n (1, 106)\t1.0\n (2, 186)\t...",0
733,734,2,"Berriman, Mr. William John",male,23.000000,0,0,28425,13.0000,Unknown,S,1,"(0, 186)\t1.0\n (1, 106)\t1.0\n (2, 186)\t...",0
382,383,3,"Tikkanen, Mr. Juho",male,21.559543,0,0,STON/O 2. 3101293,7.9250,Unknown,S,1,"(0, 186)\t1.0\n (1, 106)\t1.0\n (2, 186)\t...",0
704,705,3,"Hansen, Mr. Henrik Juul",male,26.000000,1,0,350025,7.8542,Unknown,S,1,"(0, 186)\t1.0\n (1, 106)\t1.0\n (2, 186)\t...",0
813,814,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.000000,4,2,347082,31.2750,Unknown,S,1,"(0, 186)\t1.0\n (1, 106)\t1.0\n (2, 186)\t...",1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
106,107,3,"Salkjelsvik, Miss. Anna Kristine",female,21.000000,0,0,343120,7.6500,Unknown,S,1,"(0, 186)\t1.0\n (1, 106)\t1.0\n (2, 186)\t...",1
270,271,1,"Cairns, Mr. Alexander",male,18.725152,0,0,113798,31.0000,Unknown,S,1,"(0, 186)\t1.0\n (1, 106)\t1.0\n (2, 186)\t...",0
860,861,3,"Hansen, Mr. Claus Peter",male,41.000000,2,0,350026,14.1083,Unknown,S,1,"(0, 186)\t1.0\n (1, 106)\t1.0\n (2, 186)\t...",0
435,436,1,"Carter, Miss. Lucile Polk",female,14.000000,1,2,113760,120.0000,B96 B98,S,1,"(0, 186)\t1.0\n (1, 106)\t1.0\n (2, 186)\t...",1
102,103,1,"White, Mr. Richard Frasar",male,21.550837,0,1,35281,77.2875,D26,S,1,"(0, 186)\t1.0\n (1, 106)\t1.0\n (2, 186)\t...",0

In [103]:
features = ['Pclass', 'Sex_encoded', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked_encoded']
features

['Pclass', 'Sex_encoded', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked_encoded']

In [104]:
X_train[features]

     Pclass  Sex_encoded        Age  SibSp  Parch      Fare  Embarked_encoded
331       1            0  45.500000      0      0   28.5000                 1
733       2            0  23.000000      0      0   13.0000                 1
382       3            0  21.559543      0      0    7.9250                 1
704       3            0  26.000000      1      0    7.8542                 1
813       3            1   6.000000      4      2   31.2750                 1
..      ...          ...        ...    ...    ...       ...               ...
106       3            1  21.000000      0      0    7.6500                 1
270       1            0  18.725152      0      0   31.0000                 1
860       3            0  41.000000      2      0   14.1083                 1
435       1            1  14.000000      1      2  120.0000                 1
102       1            0  21.550837      0      1   77.2875                 1

[712 rows x 7 columns]

In [105]:
#construct the decision tree
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score

clf=DecisionTreeClassifier(max_depth=3, random_state=42)
clf.fit(X_train[features], y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=3, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=42, splitter='best')

In [106]:
#predict the test data
y_pred = clf.predict(X_test[features])

In [107]:
#check the accuracy
accuracy_score(y_test, y_pred)

0.7932960893854749